In [1]:
import pandas as pd
import numpy as np

hashmap = {"John": [20, 33], "Jack": [30, 12], "Will": [34, np.nan]}
df = pd.DataFrame(hashmap)

# Missing number - NaN

> Entries missing values are given the value `NaN`. For technical reasons these NaN values are always of the float64 dtype.

pandas provides 2 exclusive methods to handle NaN

- `pd.isnull()`
- `pd.notnull()`

In [2]:
df

   John  Jack  Will
0    20    30  34.0
1    33    12   NaN

In [3]:
df[pd.notnull(df.Will)]

   John  Jack  Will
0    20    30  34.0

## Handle NaN

In [4]:
df['Will'].fillna("Unknown")

0       34.0
1    Unknown
Name: Will, dtype: object

In [5]:
# or globally
df.fillna("Unknown")

   John  Jack     Will
0    20    30     34.0
1    33    12  Unknown

## Replace NaN and any value

It's also common to replace a value, 'Invalid', 'Unknown', 'Untitled', to another value.

Use `replace(target_value, new_value)`

In [6]:
df = pd.DataFrame(hashmap)
df.replace(np.NaN, 33)

   John  Jack  Will
0    20    30  34.0
1    33    12  33.0

In [7]:
df.replace(20, 'replaced by me')

             John  Jack  Will
0  replaced by me    30  34.0
1              33    12   NaN